"""
《零基础入门学习Python》视频下载地址：传送门
测试题：
0. Python 是什么类型的语言？
1. IDLE 是什么？
2. print() 的作用是什么？
3. Python 中表示乘法的符号是什么？
4. 为什么 >>>print('I love fishc.com ' * 5) 可以正常执行，但 >>>print('I love fishc.com ' + 5) 却报错？
5. 如果我需要在一个字符串中嵌入一个双引号，正确的做法是？
6. 为什么我们要使用 Python3？Python2到底有什么问题？看起来很多程序员依然都在使用Python2？
动动手：
0. 动手试试直接输入>>>5+8 与输入>>>print(5+8) 有何不同？
1. 在交互模式中，使用 Python 计算一年有多少秒？
2. 设置你的操作系统的环境变量，以便可以轻松进入 Python 环境：
"""


'''
0.python是脚本语言
1.idle 为python shell，意思是外壳，就是一个通过键入文本与程序交互的途径
2.输出
3.*
4.无意义
5.（1）转义\符号，将“变成字符串
（2）加个（）表示一串代码
（3）用单引号引起这个字符串
6.python3.0更新后，有新特性

1. 一个吧5+8算出来，一个直接打印5+8
2.
'''
