#  1
"""
《零基础入门学习Python》视频下载地址：传送门
测试题：
0. Python 是什么类型的语言？
1. IDLE 是什么？
2. print() 的作用是什么？
3. Python 中表示乘法的符号是什么？
4. 为什么 >>>print('I love fishc.com ' * 5) 可以正常执行，但 >>>print('I love fishc.com ' + 5) 却报错？
5. 如果我需要在一个字符串中嵌入一个双引号，正确的做法是？
6. 为什么我们要使用 Python3？Python2到底有什么问题？看起来很多程序员依然都在使用Python2？
动动手：
0. 动手试试直接输入>>>5+8 与输入>>>print(5+8) 有何不同？
1. 在交互模式中，使用 Python 计算一年有多少秒？
2. 设置你的操作系统的环境变量，以便可以轻松进入 Python 环境：
"""
#  2
"""
《零基础入门学习Python》视频下载地址：传送门
测试题：
0. 什么是BIF？
1. 用课堂上小甲鱼教的方法数一数 Python3 提供了多少个 BIF？
2. 在 Python 看来：'FishC' 和 'fishc' 一样吗？
3. 在小甲鱼看来，Python 中什么是最重要的？你赞同吗？
4. 这节课的例子中出现了“=”和“==”，他们表示不同的含义，你在编程的过程中会不小心把“==”误写成“=”吗？有没有好的办法可以解决这个问题呢？
5. 你听说过“拼接”这个词吗？
动动手：
0. 编写程序：hello.py，要求用户输入姓名并打印“你好，姓名！”
例如：
"""
#  3
"""
0. 以下哪个变量的命名不正确？为什么？
    (A) MM_520  (B) _MM520_  (C) 520_MM  (D) _520_MM
1. 在不上机的情况下，以下代码你能猜到屏幕会打印什么内容吗
myteacher = '小甲鱼'
yourteacher = myteacher
yourteacher = '黑夜'
print(myteacher)

myteacher = '小甲鱼'
yourteacher = myteacher
myteacher = '黑夜'
print(yourteacher)

first = 520
second = '520'
first = second
print(first)
4. 除了使用反斜杠（\）进行字符转义，还有什么方法可以打印：Let's go! 这个字符串？
5. 如果非要在原始字符串结尾输入反斜杠，可以如何灵活处理？
6. 在这一讲中，我们说变量的命名需要注意一些地方，但小甲鱼在举例的时候貌似却干了点儿“失误”的事儿，你能看得出小甲鱼例子中哪里有问题吗？
动动手：
0. 还记得我们第一讲的动动手的题目吗？这一次要求使用变量，计算一年有多少秒？
提示：可以以 DaysPerYear（每年天数），HoursPerDay（每天小时数），MinutesPerHour（每小时分钟数），SecondsPerMinute（每分钟秒数）为变量名。
1. 关于最后提到的长字符串（三重引号字符串）其实在 Python3 还可以这么写，不妨试试，然后比较下哪种更方便？
"""
#  4
"""
测试题：

0. 请问以下代码会打印多少次“我爱鱼C！”
while 'C':
    print('我爱鱼C!')

1. 请问以下代码会打印多少次“我爱鱼C！”
i = 10
while i:
    print('我爱鱼C!')
    i = i - 1

2. 请写出与 10 < cost < 50 等价的表达式
3. Python3 中，一行可以书写多个语句吗？
4. Python3 中，一个语句可以分成多行书写吗？
5. 请问Python的 and 操作符 和C语言的 && 操作符 有何不同？【该题针对有C或C++基础的朋友】
6. 听说过“短路逻辑（short-circuit logic）”吗？
动动手：
0. 完善第二个改进要求（为用户提供三次机会尝试，机会用完或者用户猜中答案均退出循环）并改进视频中小甲鱼的代码。
"""
#  5
#  6
#  7
#  8
#  9
#  10
#  11
#  12
#  13
#  14